Repository: lf-j/Open-Source-Guides-For-The-Enterprise
Catalog: Using Open Source Code/tm/tm.tmx
Source language: en_us
Languages: ja_jp

source: Using Open Source Code
ja_jp: オープン ソース コードの使用

source: One of the most important responsibilities of an open source program office is ensuring that your organization meets its legal obligations when integrating open source code with proprietary and third-party source code in your commercial products.
ja_jp: オープン ソース プログラム オフィスの最も重要な責務の 1 つは、オープン ソース コードを商品のプロプライエタリ ソース コードやサードパーティ ソース コードと統合する際に、組織が確実に法的義務を果たすようにすることです。

source: You need to establish guidelines on how developers can use open source code, and detailed processes to track where open source code is coming from, how it’s licensed, and where it ultimately ends up.
ja_jp: 開発者がオープン ソース コードをどのように使用できるかのガイドライン、およびオープン ソース コードの出所がどこで、どのようにライセンスされ、最終的にどう使用されるかを追跡する詳細なプロセスを確立する必要があります。

source: This guide gets you started with a baseline compliance program for using, releasing, and distributing open source code.
ja_jp: このガイドでは、オープン ソース コードを使用、リリース、配布するためのベースライン コンプライアンス プログラムについて説明します。

source: Contents
ja_jp: 目次

source: Why track and review code
ja_jp: コードの追跡とレビューの必要性

source: Compliance roles and responsibilities
ja_jp: コンプライアンスにおける役割と責任

source: A simple policy for using open source code
ja_jp: オープン ソース コードのシンプルな利用ポリシー

source: Five-stage code review process
ja_jp: 5 段階のコード レビュー プロセス

source: What to do after v1.0
ja_jp: バージョン 1.0 後のプロセス

source: Sample open source usage request form
ja_jp: オープン ソース利用申請フォーム サンプル

source: Final words
ja_jp: 終わりに

source: Architecture diagram template
ja_jp: アーキテクチャ概略図テンプレート

source: View All Guides »
ja_jp: すべてのガイドを表示 »

source: Contribute on GitHub »
ja_jp: GitHub に貢献する »

source: Contributors to this Guide
ja_jp: 本ガイドの貢献者

source: VP of R&D and Head of the Open Source Group
ja_jp: Samsung Research America 社

source: Samsung Research America
ja_jp: R&D 担当 VP 兼オープン ソース グループ長

source: Section 1
ja_jp: セクション 1

source: Why track and review code?
ja_jp: コードの追跡とレビューの必要性

source: Simply stated, if your company isn’t tracking how and where its developers use open source code, you’re at risk of non compliance with applicable open source licenses — this can be an expensive path to go through both in terms of legal fees and engineering time spent to correct the error.
ja_jp: 単純な話として、開発者がオープン ソース コードをどこでどのように使用しているかを把握してない企業は、適用されるオープン ソース ライセンスに違反する恐れがあります。これは、弁護士費用の点でも、エラーの修正に費やされるエンジニアリング時間の点でもコストがかかる結果になる可能性があります。

source: Ignoring your open source legal obligations also has repercussions for your company’s reputation in the open source community.
ja_jp: また、オープン ソースの法的義務を無視することは、オープン ソース コミュニティ内で企業の評判を損なうことにもなります。

source: An open source program office helps centralize policies and decision-making around open source consumption, distribution, and release, tracks code provenance and use, and ensures the organization doesn’t run afoul of its compliance obligations.
ja_jp: オープン ソース プログラム オフィスは、オープン ソースの使用、配布、リリースに関わるポリシーおよび意思決定の一元化を支援し、コードの出所と使用を追跡して、組織がコンプライアンス義務に違反しないようにします。

source: Ideally, your open source program includes a complete compliance program, developed with the help of your legal counsel.
ja_jp: オープン ソース プログラムが包括的なコンプライアンス プログラムを含み、法務専門家の協力を得て開発されていることが理想的です。

source: In this guide, we’ll cover one important aspect of your compliance program: your policy and processes for using, releasing, and distributing open source code.
ja_jp: このガイドでは、コンプライアンス プログラムの重要な側面、つまりオープン ソース コードを使用、リリース、配布するためのポリシーとプロセスについて説明します。

source: “A well-designed open source compliance process should simultaneously ensure compliance with the terms of open source licenses and also help companies protect their own intellectual property and that of third-party suppliers from unintended disclosure and/or other consequences.”
ja_jp: 「うまく設計されたオープン ソース コンプライアンス プロセスは、オープン ソース ライセンス条項の遵守を確実にすると同時に、企業が自身の知的財産およびサードパーティ サプライヤの知的財産を意図しない漏洩やその他の結果から保護するのにも役立ちます。」

source: Ibrahim Haddad – Vice President of R&D and Head of the Open Source Group at Samsung Research America
ja_jp: Ibrahim Haddad – Samsung Research America 社 R&D 担当バイスプレジテント兼オープン ソース グループ長

source: There are several benefits companies can experience from maintaining an open source compliance program:
ja_jp: オープン ソース コンプライアンス プログラムを維持することにより、企業は次のようなメリットを得ることができます。

source: ・Gain a technical advantage.
ja_jp: ・技術的優位性の確保。

source: Since compliant software portfolios are easier to service, test, upgrade, and maintain.
ja_jp: これは、準拠ソフトウェアのポートフォリオを容易に提供、テスト、アップグレード、維持できるために実現されます。

source: ・Identify crucial pieces of open source code.
ja_jp: ・オープン ソース コードの重要部分の特定。

source: You’ll discover what code is in use across multiple products and parts of your organization, and/or are highly strategic and beneficial to your open source strategy.
ja_jp: 複数の製品や組織の部署にまたがって使用されているコードや、オープン ソース戦略にとって特に重要で有益なコードを把握できます。

source: ・Demonstrate the costs and risks associated with using open source components.
ja_jp: ・オープン ソース コンポーネントの使用に関するコストとリスクの実証。

source: This is easier to see when code goes through multiple rounds of review.
ja_jp: コードのレビューを複数回にわたって行うと、より容易に把握できます。

source: ・Build community trust.
ja_jp: ・コミュニティの信頼の構築。

source: In the event of a compliance challenge, such a program can demonstrate an ongoing pattern of acting in good faith.
ja_jp: コンプライアンスに関する問題が生じた場合、このようなプログラムにより、継続して誠意をもって行動する姿勢を示すことができます。

source: ・Prepare for a possible acquisition, sale, or new product or service release.
ja_jp: ・起こりうる買収、売却、あるいは新製品/サービスのリリースなどへの備え。

source: This is a less common ways benefit, but compliance assurance is a mandatory practice before the completion of such transactions.
ja_jp: これは、あまり一般的ではないメリットですが、このような取引を完了させるうえで、コンプライアンス保証は必須です。

source: ・Build credibility in the supply chain.
ja_jp: ・サプライ チェーン内の信頼関係の構築。

source: You can improve compliance across your software supply chain, dealing with OEMs and downstream vendors.
ja_jp: OEM や下流ベンダーとのやり取りを通じて、ソフトウェア サプライ チェーン全体のコンプライアンスを強化できます。

source: Section 2
ja_jp: セクション 2

source: Within your open source program you’ll want to create a designated open source compliance team that’s tasked with ensuring open source compliance.
ja_jp: オープン ソース プログラムでは、オープン ソース コンプライアンスの確保を目的とする専任のオープン ソース コンプライアンス チームを作ります。

source: The core team, often called the auditing team or the Open Source Review Board (OSRB), consists of representatives from engineering and product teams, one or more legal counsel, and the Compliance Officer (who is typically the open source program manager).
ja_jp: 中核となるチームは、監査チームまたはオープン ソース レビュー ボード (OSRB: Open Source Review Board) と呼ばれ、エンジニアリング チームと製品チームの担当者、1 人以上の法務専門家、およびコンプライアンス オフィサー (通常、オープン ソース プログラム マネージャー) で構成されます。

source: Other individuals across multiple departments also contribute on an ongoing basis to your open source compliance efforts: documentation, supply chain, corporate development, IT, localization and the Open Source Executive Committee (OSEC) which oversees the overall open source strategy.
ja_jp: ドキュメント製作、サプライ チェーン、経営企画、IT、ローカライゼーション、オープン ソース戦略全体を監督するオープン ソース執行委員会 (OSEC: Open Source Executive Committee) など、他のさまざまな部門の人々も、拡張チームのメンバーとしてオープン ソース コンプライアンスの取り組みに継続的に貢献しています。

source: But unlike the core team, members of the extended team are only working on compliance on a part-time basis, based on tasks they receive from the OSRB.
ja_jp: ただし、中核チームと異なり、拡張チームのメンバーは、OSRB から依頼された作業に基づいてパートタイム ベースでコンプライアンスに取り組むだけです。

source: The OSRB is in charge of creating an open source compliance strategy and a set of processes that determine how a company will implement these rules on a daily basis.
ja_jp: OSRB は、オープン ソース コンプライアンス戦略を策定し、企業が日常的に規則をどのように実施するかを決定する一連のプロセスを作成する責任を担っています。

source: The strategy establishes what must be done to ensure compliance and offers a governing set of principles for how employees interact with open source software.
ja_jp: この戦略では、コンプライアンス確保のために何をすべきかを決定し、従業員がオープン ソース ソフトウェアとどのように向き合えばよいかについて一連の統治原則を提供します。

source: It includes a formal process for the approval, acquisition, and use of open source, and a method for releasing software that contains open source or that’s licensed under an open source license.
ja_jp: これには、オープン ソースの承認、取得、使用のための正式なプロセス、およびオープン ソースを含むソフトウェアまたはオープン ソース ライセンスでライセンスされたソフトウェアのリリース方法が含まれます。

source: Section 3
ja_jp: セクション 3

source: The usage policy is an essential component of any compliance program.
ja_jp: 利用ポリシーは、すべてのコンプライアンス プログラムにとって不可欠なコンポーネントです。

source: This set of rules is included in your open source strategy document (you have one, right?) and made available to everyone for easy reference.
ja_jp: この一連の規則は、オープン ソース戦略文書 (既にお持ちのはずです) に含まれ、誰でも入手して簡単に参照できるようになっています。

source: The usage policy ensures that any software (proprietary, third-party, or open source) that makes its way into the product base has been audited, reviewed, and approved.
ja_jp: 利用ポリシーは、製品を支えるすべてのソフトウェア (プロプライエタリ、サードパーティ製、オープン ソースを問わず) の監査、レビュー、承認が完了していることを保証するものです。

source: It also ensures that your company has a plan to fulfill the license obligations resulting from using the various software components, before your products make it to customers.
ja_jp: また、さまざまなソフトウェア コンポーネントを使用することで生じたライセンス義務を履行するための計画を、製品が顧客の元に届く前に立ててあることを保証します。

source: There is no need to make a lengthy or complicated document.
ja_jp: 長い文書や複雑な文書を作成する必要はありません。

source: A good open source usage policy includes six simple rules:
ja_jp: 適切なオープン ソース利用ポリシーには、次の 6 つの簡単な規則が含まれます。

source: ・Engineers must receive approval from the OSRB before integrating any open source code in a product.
ja_jp: ・技術者は、オープン ソース コードを製品に統合する前に OSRB から承認を得る必要があります。

source: ・Software received from third parties must be audited to identify any open source code included, which ensures license obligations can be fulfilled before a product ships.
ja_jp: ・サードパーティから受け取ったソフトウェアは、監査を受けて、含まれているオープン ソース コードを特定する必要があります。これにより、製品出荷前にライセンス義務を確実に履行することができます。

source: ・All software must be audited and reviewed, including all proprietary software components.
ja_jp: ・すべてのソフトウェアは、すべてのプロプライエタリ ソフトウェア コンポーネントも含めて、監査およびレビューを受ける必要があります。

source: ・Products must fulfill open source licensing obligations prior to customer receipt.
ja_jp: ・製品は、顧客が受け取る前にオープン ソース ライセンス義務を履行する必要があります。

source: ・Approval for using a given open source component in one product is not approval for another deployment, even if the open source component is the same.
ja_jp: ・ある製品で特定のオープン ソース コンポーネントの使用が承認されても、その同じオープン ソース コンポーネントを別の展開で使用することが承認されたことにはなりません。

source: ・All changed components must go through the approval process.
ja_jp: ・変更されたコンポーネントはすべて、承認プロセスを経る必要があります。

source: Section 4
ja_jp: セクション 4

source: 5-stage code review process
ja_jp: 5 段階のコード レビュー プロセス

source: Once you have a policy in place, you must plan and create a process that makes it easy to apply the policy.
ja_jp: 利用ポリシーを策定したら、そのポリシーを容易に適用できるプロセスを計画し、作成します。

source: Your job is to grease the wheels for developer use of open source and contribution to open source projects.
ja_jp: 開発者がオープン ソースの利用とオープン ソース プロジェクトへの貢献を円滑に行えるようにする必要があります。

source: “If your code review process is overly burdensome, you’ll slow innovation or provide a good excuse for developers to circumvent the process completely.”
ja_jp: 「コードのレビュー プロセスがあまりに面倒なものだと、イノベーションのスピードが落ちたり、開発者にプロセス全体を回避する格好の口実を与えることになります。」

source: The process begins by scanning the source code of the software package in question, then moves on to identifying and resolving any discovered issues, performing legal and architectural reviews, and making a decision regarding the usage approval.
ja_jp: プロセスではまず、対象となっているソフトウェア パッケージのソース コードをスキャンします。次に、発見された問題を特定および解決し、法的レビューとアーキテクチャ レビューを行ったのち、利用承認に関する決定を行います。

source: The diagram, below, illustrates a simplistic view of a compliance usage process.
ja_jp: 下の図は、コンプライアンス利用プロセスを単純化して図示したものです。

source: In reality, the process is much more iterative in nature.
ja_jp: 実際には、プロセスはその性質上、はるかに双方向的です。

source: Keep in mind that these phases are for illustration purposes and may need to be modified depending on your company’s own needs and open source program configuration.
ja_jp: 以下の各段階は説明を目的としており、企業のニーズやオープン ソース プログラムの構成に応じて変更が必要な場合があることに注意してください。

source: Let’s walk through each stage in the process.
ja_jp: プロセスの各段階を順を追って説明しましょう。

source: Stage 1: Source Code Scan
ja_jp: 第 1 段階: ソース コードのスキャン

source: In the source code scanning phase, all the source code is scanned using a specialized software tools (there are many commercial vendors that offer such tools in addition to a couple open source alternatives).
ja_jp: ソース コードのスキャン段階では、専門のソフトウェア ツールを使用して、すべてのソース コードがスキャンされます (このようなツールは、いくつかのオープン ソース ツールの他に、数多くの商用ベンダーから提供されています)。

source: This phase typically kicks off when an engineer submits an online usage form.
ja_jp: この段階は、通常、技術者がオンラインの利用フォームを提出することで開始されます

source: (See the sample usage form and rules for using it, below.)
ja_jp: (以下のサンプルの利用フォームと利用規則を参照)。

source: The form includes all the information about the open source component in question, and specifies the location of the source code in the source code repository system.
ja_jp: このフォームには、対象となっているオープン ソース コンポーネントに関するすべての情報を含め、ソース コード リポジトリ システム内のソース コードの場所を指定します。

source: The form submission automatically creates a compliance ticket in a system such as JIRA or Bugzilla and a source code scanning request will be sent to the designated auditing staff.
ja_jp: フォームを提出すると、JIRA、Bugzilla などのシステムにコンプライアンス チケットが自動的に作成され、指定された監査スタッフにソース コード スキャン要求が送られます。

source: Periodic full platform scans should also take place every few weeks to ensure that no open source software component has been integrated into the platform without a corresponding form.
ja_jp: 対応する利用フォームの提出なしにオープン ソース ソフトウェア コンポーネントがプラットフォームに統合されることがないようにするため、プラットフォームの定期的なフル スキャンも数週間ごとに行う必要があります。

source: If any was found, then a JIRA ticket is automatically issued and assigned to the auditing staff.
ja_jp: 何らかの問題が見つかった場合は、JIRA チケットが自動的に発行され、監査スタッフに割り当てられます。

source: Some of the factors that can trigger a source code scan include:
ja_jp: ソース コードのスキャンが開始される要因には、次のようなものがあります。

source: ・An incoming usage form, usually filled out by engineering staff.
ja_jp: ・利用フォーム (通常はエンジニアリング スタッフが入力) の受信。

source: ・A periodically scheduled full platform scan.
ja_jp: ・定期的にスケジュールされているプラットフォームのフル スキャン。

source: Such scans are very useful for uncovering open source code that snuck into your software platform without a usage form.
ja_jp: このようなスキャンは、利用フォームが提出されないままソフトウェア プラットフォームに密かに入り込んだオープン ソース コードを発見するのに非常に役立ちます。

source: ・Changes in a previously approved software component.
ja_jp: ・以前に承認されたソフトウェア コンポーネントの変更。

source: In many cases, engineers start evaluating and testing with a certain version of an OSS component, and later adopt that component when a new version is available.
ja_jp: 多くの場合、技術者はまず、OSS コンポーネントの特定のバージョンを評価およびテストし、その後、新しいバージョンが利用可能になると、そのコンポーネントを採用します。

source: ・Source code is received from a third-party software provider who may or may not have disclosed open source.
ja_jp: ・サードパーティ ソフトウェア プロバイダからのソース コードの入手。プロバイダがオープン ソースを公開しているかどうかは問いません。

source: ・Source code is downloaded from the web with an unknown author and/or license, which may or may not have incorporated open source code.
ja_jp: ・作成者やライセンスが不明なソース コードの Web からのダウンロード。ソース コードにオープン ソース コードが組み込まれているかどうかは問いません。

source: ・A new proprietary software component enters the build system where engineering may or may not have borrowed open source code and used it in a proprietary software component.
ja_jp: ・新しいプロプライエタリ ソフトウェア コンポーネントのビルド システムへの組み込み。エンジニアリング担当者がオープン ソース コードを借用し、それをプロプライエタリ ソフトウェア コンポーネントで使用したかどうかは問いません。

source: After the code is scanned, the scanning tool produces a report that provides information on:
ja_jp: コードのスキャンが終了すると、スキャン ツールは、以下の情報を提供するレポートを生成します。

source: ・Known software components in use, also known as the software Bill of Materials (BoM)
ja_jp: ・使用されている既知のソフトウェア コンポーネント。ソフトウェア部品表 (BOM) とも呼ばれます。

source: ・Licenses in effect, license texts, and summary of obligations
ja_jp: ・有効なライセンス、ライセンス テキスト、義務の概要

source: ・License conflicts to be verified by legal
ja_jp: ・法務専門家による検証が必要なライセンス抵触

source: ・File inventory
ja_jp: ・ファイル目録

source: ・Identified files
ja_jp: ・識別されたファイル

source: ・Dependencies
ja_jp: ・依存関係

source: ・Code matches
ja_jp: ・コードの一致

source: ・Files pending identification
ja_jp: ・識別保留中のファイル

source: ・Source code matches pending identification
ja_jp: ・保留中の識別と一致するソース コード

source: Note on Downloaded Open Source Packages
ja_jp: ダウンロードしたオープン ソース パッケージに関する注意

source: It is vital to archive open source packages downloaded from the web in their original form.
ja_jp: Web からダウンロードしたオープン ソース パッケージは、元の形のまま保管しておくことが重要です。

source: These packages will be used in a later stage (prior to distribution) to verify and track any changes introduced to the source code by computing the difference between the original package and the modified package.
ja_jp: このパッケージは、後の段階で (配布前) 元のパッケージと変更後のパッケージの間の差分を計算することにより、ソース コードに加えられた変更を検証および追跡するために使用します。

source: If a third-party software provider uses open source, the product team integrating that code into the product must submit an open source usage form describing the open source to be used.
ja_jp: サードパーティ ソフトウェア プロバイダがオープン ソースを使用している場合、そのコードを製品に統合する製品チームは、使用されているオープン ソースについて記述したオープン ソース利用申請フォームを提出する必要があります。

source: If the third-party software provider only provides binaries, not source code, then the product team and/or the software supplier manager who manages the relationship with the third-party software provider must obtain a confirmation (for instance, a scan report) that there is no open source in the provided software.
ja_jp: サードパーティ ソフトウェア プロバイダがソース コードを提供せず、バイナリしか提供しない場合は、製品チーム、またはサードパーティ ソフトウェア プロバイダとの関係を管理するソフトウェア サプライヤ マネージャーは、提供されたソフトウェアにオープン ソースが含まれていないという確証 (たとえば、スキャン レポート) を得る必要があります。

source: Stage 2: Identification and Resolution
ja_jp: 第 2 段階: 特定および解決

source: In the identification and resolution phase, the auditing team inspects and resolves each file or snippet flagged by the scanning tool.
ja_jp: 特定および解決段階では、監査チームが、スキャン ツールによってフラグが付けられたファイルまたはスニペットを検査し、解決します。

source: For example, the scanning tool’s report can flag issues such as conflicting and incompatible licenses.
ja_jp: たとえば、スキャン ツールのレポートは、矛盾するライセンスや互換性のないライセンスなどの問題にフラグを付けます。

source: If there are no issues, then the compliance office will move the compliance ticket forward to the legal review phase.
ja_jp: 問題がない場合、コンプライアンス オフィサーはコンプライアンス チケットを法的レビュー段階へ進めます。

source: If there are issues to be resolved, then the compliance officer creates subtasks within the compliance tickets and assigns them to the appropriate engineers to be resolved.
ja_jp: 解決すべき問題がある場合、コンプライアンス オフィサーはコンプライアンス チケット内にサブタスクを作成して、適切なエンジニアリング担当者に割り当てて解決させます。

source: In some cases, a code rework is needed; in other cases it may simply be a matter of clarification.
ja_jp: コーディングし直す必要がある場合も、確認だけで済む場合もあります。

source: The sub-tasks should include a description of the issue, a proposed solution to be implemented by engineering, and a specific timeline for completion.
ja_jp: サブタスクには、問題の説明、エンジニアリング担当者が実施すべき解決策の提案、完了までのタイムラインを含める必要があります。

source: The compliance officer may simply close the subtasks once all issues are resolved and pass the ticket along for legal review.
ja_jp: すべての問題が解決したら、コンプライアンス オフィサーはサブタスクを閉じ、チケットを法的レビューに渡すことができます。

source: Or they might first order a re-scan of the source code and generate a new scan report confirming that earlier issues do not exist anymore.
ja_jp: あるいは、まずソース コードの再スキャンを指示し、新しいスキャン レポートを生成してから、以前の問題がなくなったことを確認するという方法もあります。

source: Once they’re satisfied that all issues are resolved, the compliance officer forwards the compliance ticket to a representative from the legal department for review and approval.
ja_jp: すべての問題が解決されたと納得できたら、コンプライアンス オフィサーは、レビューと承認のためにコンプライアンス チケットを法務部門の担当者に送ります。

source: In preparation for legal review, you should attach all licensing information related to the open source software to the compliance ticket, such as COPYING, README, LICENSE files, etc.
ja_jp: 法的レビューに向けた準備として、オープン ソース ソフトウェアに関連するすべてのライセンス情報 (COPYING、README、LICENSE ファイルなど) をコンプライアンス チケットに添付する必要があります。

source: Stage 3: Legal Review
ja_jp: 第 3 段階: 法的レビュー

source: In the legal review phase, the legal counsel (typically a member of the open source review board, or OSRB) reviews reports generated by the scanning tool, the license information of the software component, and any comments left in the compliance ticket by engineers and members of the auditing team.
ja_jp: 法的レビュー段階では、法務専門家 (通常、オープン ソース レビュー ボード (OSRB) のメンバー) がスキャン ツールによって生成されたレポート、ソフトウェア コンポーネントのライセンス情報、エンジニアリング担当者や監査チームのメンバーがコンプライアンス チケットに残したコメントなどのレビューを行います。

source: When a compliance ticket reaches the legal review phase, it already contains:
ja_jp: 法的レビュー段階に到達したコンプライアンス チケットには、既に以下が含まれています。

source: ・A source code scan report and confirmation that all the issues identified in the scanning phase have been resolved.
ja_jp: ・ソース コード スキャン レポート、およびスキャン段階で特定されたすべての問題が解決済みであることの確認。

source: ・Copies of the license information attached to the ticket: typically, the compliance officer attaches the README, COPYING, and AUTHORS files available in the source code packages to the compliance ticket.
ja_jp: ・チケットに添付されたライセンス情報のコピー。通常、コンプライアンス オフィサーは、ソース コード パッケージで入手できる README、COPYING、および AUTHORS ファイルをコンプライアンス チケットに添付します。

source: Other than the license information, which for OSS components is usually available in a COPYING or a LICENSE file, you need to also capture copyright and attribution notices as well.
ja_jp: ライセンス情報 (OSS コンポーネントでは、通常、COPYING ファイルまたは LICENSE ファイルで確認できます) の他に、著作権や帰属告知についても取得する必要があります。

source: This information will provide appropriate attributions in your product documentation.
ja_jp: この情報は、製品ドキュメントに適切な帰属を提供します。

source: ・Feedback from the compliance officer regarding the compliance ticket (concerns, additional questions, etc.).
ja_jp: ・コンプライアンス チケットに関するコンプライアンス オフィサーからのフィードバック (懸念事項、新たな疑問点など)。

source: ・Feedback from the engineering representative on the auditing team or from the engineer (package owner) who follows/maintains this package internally.
ja_jp: ・監査チームに対するエンジニアリング担当者からのフィードバック、またはこのパッケージを内部で追跡/維持する技術者 (パッケージ所有者) からのフィードバック。

source: The goal of this phase is to produce a legal opinion of compliance, and a decision on the incoming and outgoing license(s) for the software component in question.
ja_jp: この段階の目標は、コンプライアンスに関する法務専門家の見解をまとめ、対象となっているソフトウェア コンポーネントでの使用ライセンスと被使用ライセンスについて決定することです。

source: The incoming and outgoing licenses are in the plural form because in some cases, a software component can include source code available under different licenses.
ja_jp: ソフトウェア コンポーネントには複数のライセンスの下で利用できるソース コードが含まれている場合があるため、使用ライセンスと被使用ライセンスは、複数ある場合があります。

source: There are three possible outcomes at this stage:
ja_jp: この段階では、次の 3 つの結果が得られる可能性があります。

source: No issues
ja_jp: 問題なし

source: If there are no issues with the licensing, the legal counsel would then decide on the incoming and outgoing licenses of the software component and forward the compliance ticket one step further in the process into the compliance architectural phase.
ja_jp: ライセンスに関して問題がない場合、法務専門家は、ソフトウェア コンポーネントの使用ライセンスと被使用ライセンスを決定し、コンプライアンス チケットのプロセスをコンプライアンスのアーキテクチャ段階へと一歩進めます。

source: The incoming license is the license under which you received the software package.
ja_jp: 使用ライセンスは、受け取ったソフトウェア パッケージに対するライセンスです。

source: The outgoing license is the license under which you are licensing the software package.
ja_jp: 被使用ライセンスは、自身がライセンスしているソフトウェア パッケージに対するライセンスです。

source: In some cases, when the incoming license is a permissive license that allows relicensing (e.g., BSD), companies will relicense that software under their own proprietary license.
ja_jp: 場合によっては、使用ライセンスが再ライセンス (BSD など) を許可するパーミッシブ ライセンスであることがあり、その場合、企業は、自身のプロプライエタリ ライセンスの下でソフトウェアを再ライセンスします。

source: A more complex example would be a software component that includes proprietary source code, source code licensed under License-A, source code that is available under License-B, and source code available under License-C.
ja_jp: さらに複雑な例として、ソフトウェア コンポーネントにプロプライエタリ ソース コード、ライセンス A でライセンスされたソース コード、ライセンス B の下で利用できるソース コード、ライセンス C の下で利用できるソース コードが含まれる場合を考えます。
